=====================================
Metavariables
=====================================

class $CLASS {
    fun $FOO($VAR:$TYPE) {
        foo($X, 2)
    }
}

---

(source_file
  (class_declaration
    (type_identifier)
    (class_body
      (function_declaration
        (simple_identifier)
        (parameter
          (simple_identifier)
          (user_type
            (type_identifier)))
        (function_body
          (statements
            (call_expression
              (simple_identifier)
              (call_suffix
                (value_arguments
                  (value_argument
                    (simple_identifier))
                  (value_argument
                    (integer_literal)))))))))))


=====================================
Expression Ellipsis 
=====================================

class Foo {
  fun bar() {
    ...
  }
}

---

(source_file
  (class_declaration
    (type_identifier)
    (class_body
      (function_declaration
        (simple_identifier)
        (function_body
          (statements
            (ellipsis)))))))


=====================================
Deep Ellipsis
=====================================

class Foo {
    fun bar() {
        val x = foo2(<...var...>,var2)
    }
}

---

(source_file
  (class_declaration
    (type_identifier)
    (class_body
      (function_declaration
        (simple_identifier)
        (function_body
          (statements
            (property_declaration
              (variable_declaration
                (simple_identifier))
              (call_expression
                (simple_identifier)
                (call_suffix
                  (value_arguments
                    (value_argument
                      (deep_ellipsis
                        (simple_identifier)))
                    (value_argument
                      (simple_identifier))))))))))))

=====================================
Field Ellipsis
=====================================
class Foo {
  ...
}

---
(source_file
    (class_declaration (type_identifier)
       (class_body (ellipsis))))

=====================================
Argument Ellipsis
=====================================
foo(1, ..., 2)

---
(source_file
   (call_expression (simple_identifier)
      (call_suffix (value_arguments
         (value_argument (integer_literal))
	 (value_argument (ellipsis))
	 (value_argument (integer_literal))))))

=====================================
Parameter Ellipsis
=====================================
fun foo(..., bar: String, ...) {}

---

(source_file
  (function_declaration (simple_identifier)
     (ellipsis)
     (parameter (simple_identifier) (user_type (type_identifier)))
     (ellipsis)
     (function_body))) 

=====================================
Class Parameter Ellipsis
=====================================
class Foo(...) : Filter {
}

---
(source_file
   (class_declaration (type_identifier)
       (primary_constructor (class_parameter (ellipsis)))
       (delegation_specifier (user_type (type_identifier)))
     (class_body)))

=====================================
Statement Ellipsis
=====================================
fun foo() {
  a()
  ...
  b()
}

---
(source_file
  (function_declaration (simple_identifier)
    (function_body
      (statements
        (call_expression (simple_identifier) (call_suffix (value_arguments)))
	(ellipsis)
	(call_expression (simple_identifier) (call_suffix (value_arguments))))
	)))

=====================================
Statement Ellipsis and metavarible
=====================================

$COOKIE.setValue("")
...

---
(source_file
  (call_expression
    (navigation_expression (simple_identifier)
       (navigation_suffix (simple_identifier)))
    (call_suffix (value_arguments (value_argument (line_string_literal)))))
  (ellipsis))
