================================================================================
Ellipsis
================================================================================

...

--------------------------------------------------------------------------------

(program
  (semgrep_ellipsis_followed_by_newline))

================================================================================
Top level statements
================================================================================

foo()
...
bar()

--------------------------------------------------------------------------------

(program
  (call
    (identifier)
    (argument_list))
  (semgrep_ellipsis_followed_by_newline)
  (call
    (identifier)
    (argument_list)))

================================================================================
Top level statements on the same line
================================================================================

foo() ... bar()

--------------------------------------------------------------------------------

(program
  (range
    (call
      (identifier)
      (argument_list))
    (call
      (identifier)
      (argument_list))))

================================================================================
Range
================================================================================

1 ... 2

--------------------------------------------------------------------------------

(program
  (range
    (integer)
    (integer)))

================================================================================
Range with no spaces
================================================================================

1...2

--------------------------------------------------------------------------------

(program
  (range
    (integer)
    (integer)))

================================================================================
Range in a confined area
================================================================================

x = foo(1...2)

--------------------------------------------------------------------------------

(program
  (assignment
    (identifier)
    (call
      (identifier)
      (argument_list
        (range
          (integer)
          (integer))))))

================================================================================
Ellipsis as argument
================================================================================

x = foo(1, ...)

--------------------------------------------------------------------------------

(program
  (assignment
    (identifier)
    (call
      (identifier)
      (argument_list
        (integer)
        (forward_argument)))))

================================================================================
Ellipsis as parameter
================================================================================

def method (x, ...)
end

--------------------------------------------------------------------------------

(program
  (method
    (identifier)
    (method_parameters
      (identifier)
      (forward_parameter))))

================================================================================
Ellipsis in dot chain
================================================================================

x. ... .z()

--------------------------------------------------------------------------------

(program
  (call
    (call
      (identifier)
      (identifier))
    (identifier)
    (argument_list)))

================================================================================
Ellipsis as exp
================================================================================

x = ...

--------------------------------------------------------------------------------

(program
  (assignment
    (identifier)
    (semgrep_ellipsis_followed_by_newline)))

================================================================================
Ellipsis at end of program without newline
================================================================================
$X = ...
--------------------------------------------------------------------------------

(program
  (assignment
    (global_variable)
    (semgrep_ellipsis_followed_by_newline)))

================================================================================
Metavariable
================================================================================

$X

--------------------------------------------------------------------------------

(program
  (global_variable))

================================================================================
Metavariable as argument
================================================================================

foo($X, $Y)

--------------------------------------------------------------------------------

(program
  (call
    (identifier)
    (argument_list
      (global_variable)
      (global_variable))))

================================================================================
Metavariable as call ident
================================================================================

$Z(1, 2)

--------------------------------------------------------------------------------

(program
  (call
    (global_variable)
    (argument_list
      (integer)
      (integer))))

================================================================================
Metavariable for dot access field
================================================================================

foo.$Z()

--------------------------------------------------------------------------------

(program
  (call
    (identifier)
    (identifier)
    (argument_list)))

================================================================================
Deep ellipsis operator
================================================================================

<... foo ...>

--------------------------------------------------------------------------------

(program
  (deep_ellipsis
    (identifier)))

================================================================================
Deep ellipsis operator
================================================================================

$X = <... 1 + 2 ...>

--------------------------------------------------------------------------------

(program
  (assignment
    (global_variable)
    (deep_ellipsis
      (binary
        (integer)
        (integer)))))

================================================================================
Metavariable ellipsis
================================================================================

$...X

--------------------------------------------------------------------------------

(program
  (identifier))

================================================================================
Metavariable ellipsis with statements
================================================================================

foo()
$...X
bar()

--------------------------------------------------------------------------------

(program
  (call
    (identifier)
    (argument_list))
  (identifier)
  (call
    (identifier)
    (argument_list)))

================================================================================
Metavariable ellipsis with statements
================================================================================

foo($...X, 1)

--------------------------------------------------------------------------------

(program
  (call
    (identifier)
    (argument_list
      (identifier)
      (integer))))
