====================
Semgrep Ellipsis
====================

__SEMGREP_EXPRESSION
...

---

(source_file
    (semgrep_expression
    (ellipsis)))

========================
Semgrep Metavariables
========================

__SEMGREP_EXPRESSION
call(..., $VAR)

---

(source_file
    (semgrep_expression
        (call_expr
          (name_access_chain
            (identifier))
          (call_args
            (ellipsis)
            (var
              (name_access_chain
                (identifier)))))))

====
Semgrep Statement
====

__SEMGREP_STATEMENT
let _: u64 = if (cond) { ... } else { s2 + <... $...SOME ...> }.f;

---
(source_file
    (semgrep_statement
    (let_expr
        (bind_list
        (var_name
            (identifier)))
        (type
        (primitive_type
            (number_type)))
        (access_field
        (if_expr
            (parenthesized_expr
            (var
                (name_access_chain
                (identifier))))
            (block
            (ellipsis))
            (block
            (bin_op_expr
                (var
                (name_access_chain
                    (identifier)))
                (binary_operator)
                (deep_ellipsis
                    (var
                      (name_access_chain
                        (identifier)))))))
        (identifier)))))


=========
struct
=========

module 0xdeadbeef::mod {
    struct $STRUCT has key {
        ...
    }
}

---

(source_file
    (module
    (numerical_addr
        (number))
    (identifier)
    (declaration
        (struct_decl
        (identifier)
        (abilities
            (ability))
        (body
            (field_annot
            (ellipsis)))))))

=======================
Spec with attributes
=======================

module 0xdeadbeef::mod {
    use 0x1::xx::...;
    #[..., attr(...)]
    spec module {
        fun spec_incr(x: num): num { ... }
        axiom forall x: num: (...);
        ...
    }
}
---

(source_file
    (module
    (numerical_addr
        (number))
    (identifier)
    (declaration
        (use_decl
        (module_ident
            (numerical_addr
            (number))
            (identifier))
        (member
            (ellipsis))))
    (declaration
        (attributes
        (attribute
            (ellipsis))
        (attribute
            (identifier)
            (attribute
            (ellipsis))))
        (spec_block
        (spec_block_target)
        (spec_func
            (identifier)
            (parameters
            (parameter
                (identifier)
                (type
                (name_access_chain
                    (identifier)))))
            (type
            (name_access_chain
                (identifier)))
            (block
            (ellipsis)))
        (spec_axiom
            (quantifier
            (quantifier_bind
                (identifier)
                (type
                (name_access_chain
                    (identifier))))
            (tuple_expr
                (ellipsis))))
        (ellipsis)))))

=======================
Typed Metavariables
=======================

__SEMGREP_EXPRESSION
call(arr1, arr2, ($VAR: u32), $VAR2)

---
(source_file
    (semgrep_expression
    (call_expr
        (name_access_chain
        (identifier))
        (call_args
        (var
            (name_access_chain
            (identifier)))
        (var
            (name_access_chain
            (identifier)))
        (typed_metavariable
            (identifier)
            (type
            (primitive_type
                (number_type))))
        (var
            (name_access_chain
            (identifier)))))))

=======================
Type Parameters & Arguments; Struct Bind Field & Pack Field; For Ellipsis
=======================

module 0xdeadbeef::mod {
    struct $STRUCT<$T1, ...> has key {
        ...
    }

    fun $FUN() {
        let $STRUCT<u32, ..., $T1> { ... } = Struct2 {
            ...,
            field1: $VAR,
            $VAR2,
        };

        for (...) { ... }
    }
}

---

(source_file
    (module
    (numerical_addr
        (number))
    (identifier)
    (declaration
        (struct_decl
        (identifier)
        (type_params
            (type_param
            (identifier))
            (type_param
            (ellipsis)))
        (abilities
            (ability))
        (body
            (field_annot
            (ellipsis)))))
    (declaration
        (function_decl
        (identifier)
        (parameters)
        (block
            (let_expr
            (bind_list
                (name_access_chain
                (identifier))
                (type_args
                    (type
                        (primitive_type
                            (number_type)))
                    (type
                        (ellipsis))
                    (type
                        (name_access_chain
                        (identifier))))
                (fields
                (bind_field
                    (ellipsis))))
            (pack_expr
                (name_access_chain
                    (identifier))
                  (expr_field
                    (ellipsis))
                  (expr_field
                    (identifier)
                    (var
                      (name_access_chain
                        (identifier))))
                  (expr_field
                    (shorthand_field_identifier))))
        (for_loop_expr
                (ellipsis)
                (block
                  (ellipsis))))))))